#include "iwdg.h"


/*********************************************************
function name: 独立看门狗初始化函数	
fun :		
*********************************************************/
void IWDG_init(void)
{
    /*独立看门狗不需要开启时钟  */
	IWDG->KR=0x5555; 			    //允许访问键寄存器和重装载寄存器
	/*设置预分频*/
	IWDG->PR =4;				    //4代表是64分频	(最短时间0.1ms 最长时间409.6mS)
	/*设置重装载值   5需要喂狗一次*/
	IWDG->RLR =5000.0/(40.0/64.0);			
	IWDG->KR=0xAAAA; 			    //第一次喂狗，将重装载值放入重装载值寄存器中
	IWDG->KR=0xCCCC; 			    //启动看门狗
}

/*********************************************************
function name: 喂独立看门狗函数
fun :
*********************************************************/
void IWDG_feed(void)
{
	IWDG->KR=0xAAAA; 				//喂狗，将重装载值放入重装载值寄存器中
}

